# SlopeAngle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FootPrintRoof..::..SlopeAngle Property
FootPrintRoof Class See Also
---
Retrieve or set the SlopeAngle of the curve.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double this[
	ModelCurve pCurve
] { get; set; }
```

Visual Basic
---
```text
Public Property SlopeAngle ( _
	pCurve As ModelCurve _
) As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SlopeAngle[ModelCurve^ pCurve] {
	double get (ModelCurve^ pCurve);
	void set (ModelCurve^ pCurve, double value);
}
```

# ### Parameters
pCurve
    Type: Autodesk.Revit.DB..::..ModelCurve
# Remarks
The value is a "slope" measurement. For example, 0.5 is one unit of rise for each 2 units of run. This creates a slope of 26.57 degrees (the arctangent of 0.5).
# See Also
FootPrintRoof Class
Autodesk.Revit.DB Namespace